/*
 * [변수의 종류]
 * 	1. 지역 변수
 * 		: 메소드 내 선언 --> 영역 내 선언(ex: for, while...)
 * 		: 메모리 영역 - Stack
 * 		: 초기화를 하지 않으면, 쓰레기 값 저장
 * 		: 변수가 선언된 영역을 벗어나면, 메모리 해제
 * 
 *  2. 멤버 변수 
 *  	- Instance 변수(객체 변수)
 *  		: 선언 위치 - Class 내
 *  		: 메모리 영역 - Heap
 *  		: 초기화를 하지 않으면, 0/null로 자동 초기화
 *  		: 인스턴스(객체)가 소멸될 때, 메모리 해제
 *  
 *  	- Static 변수(Class 변수)
 *  		: 선언 위치 - Class 내
 *  		: 메모리 영역 - static
 *  		: 초기화를 하지 않으면, 0/null로 자동 초기화
 *  		: 프로그램 종료 시, 메모리 해제
 *  
 *    		============================================================================
 *  					메모리 할당 시기		메모리 해제 시기		메모리 영역
 *  		----------------------------------------------------------------------------
 *  		instance	객체 생성될 때			객체 소멸될 때				Heap
 *  		----------------------------------------------------------------------------
 *  		static		class가 load될 때		프로그램 종료			   static
 *  		============================================================================
 *  
 *  3. final 변수
 *  	: 초기화한 값으로 고정
 *  	: 값 변경 시 Error, 값 변경 금지
 */

public class VariableEx01 {

	public static void main(String[] args) {

		// 지역 변수
		int num = 5;
		
		num += 1;
		System.out.println("int num >> " + num);
		
		// final 변수 : 상수화, 값 변경 금지
		final int VAR = 10;
//		VAR += 1;  ==> Error
		System.out.println("final int VAR >> " + VAR);
		
		// 초기화 값으로 고정. 사실상 변수가 아닌 상수.
		final int ONE;
		ONE = 1;
		System.out.println("final int ONE >> " + ONE);
		
	}

}
